To copy a nested link, use Copy to Clipboard or Move Copy.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotCopyNestedLinks { get; }
  Visual Basic
Public Shared ReadOnly Property CannotCopyNestedLinks As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotCopyNestedLinks {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures CopyPasteFailures Class
  Autodesk.Revit.DB Namespace